### Needed for BackerKit server and specs

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/devel-only"
tap "homebrew/services"
tap "caskroom/cask"

brew "bash-git-prompt"
brew "chromedriver", restart_service: true
brew "direnv"
brew "git"
brew 'heroku'
brew "imagemagick@6"
brew "mas"
brew "postgresql", restart_service: true
brew "pow"
brew "rbenv"
brew "redis", restart_service: true

cask "google-chrome"

mas "Xcode", id: 497799835




### Developer quality of life tools

tap 'homebrew/command-not-found'
tap 'homebrew/completions'

brew 'bash-completion'
brew 'brew-cask-completion'
brew 'bundler-completion'
brew 'gem-completion'
brew 'rails-completion'
brew 'rake-completion'
brew 'ruby-completion'
brew 'tmux'

cask 'atom'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'github-desktop'
cask 'lastpass'
cask 'launchcontrol'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookei'
cask 'rubymine'
cask 'screenhero'
cask 'skitch'
cask 'slack'
cask 'subl'
cask 'sublime-text'
cask 'xtabulator'
